---
type: RevitLinkOperations
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# RevitLinkOperations

`Autodesk.Revit.DB.RevitLinkOperations` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | SetGetLocalPathForOpenCallback | 2015 | `public void SetGetLocalPathForOpenCallback ( IGetLocalPathForOpenCallback makeLocalCopyForOpen )` |